**Naive Bayes**  
Think about conditional probability.  
Makes a naive assumption that features such as male, class, age, cabin, fare etc. are independent of each other.  
Has a number of uses such as in email spam Detection, facial recognition, character recognition etc.

In [ ]:
from google.colab import drive

drive.mount('/content/drive')

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("drive/My Drive/Colab Notebooks/Naive Bayes/titanic.csv")
df.head()

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500

[5 rows x 8 columns]

In [ ]:
df.drop(['Name', 'Siblings/Spouses Aboard', 'Parents/Children Aboard'], axis='columns', inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [ ]:
targets = df.Survived
inputs = df.drop('Survived', axis='columns')

Use dummies column for one-hot encoding

In [ ]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [ ]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [ ]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [ ]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [ ]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    27.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:
from sklearn.model_selection import train_test_split
features_train, features_test, labels_train, labels_test = train_test_split(
    inputs, targets, test_size=0.2)

In [ ]:
len(features_train)

709

In [ ]:
len(features_test)

178

In [ ]:
len(inputs)

887

Using Gaussian NB

In [ ]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [ ]:
model.fit(features_train, labels_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [ ]:
model.score(features_test, labels_test)  # Gives accuracy

0.7359550561797753

In [ ]:
features_test[:10]

     Pclass   Age      Fare  female  male
472       1  40.0   52.0000       0     1
656       1  58.0  113.2750       0     1
600       3  44.0    8.0500       0     1
535       3  69.0   14.5000       0     1
161       3  26.0    7.7750       0     1
628       3  51.0    7.0542       0     1
868       1  33.0    5.0000       0     1
457       1  48.0   26.5500       0     1
21        2  34.0   13.0000       0     1
592       3  36.0   24.1500       0     1

In [ ]:
labels_test[:10]

472    0
656    0
600    0
535    0
161    0
628    0
868    0
457    1
21     1
592    0
Name: Survived, dtype: int64

In [ ]:
model.predict(features_test[:10])

array([0, 1, 0, 0, 0, 0, 0, 0, 0, 0])

In [ ]:
model.predict_proba(features_test[:10])

array([[0.88719648, 0.11280352],
       [0.13802954, 0.86197046],
       [0.99188598, 0.00811402],
       [0.9919809 , 0.0080191 ],
       [0.99092181, 0.00907819],
       [0.99195503, 0.00804497],
       [0.93160724, 0.06839276],
       [0.93520944, 0.06479056],
       [0.98209345, 0.01790655],
       [0.99148412, 0.00851588]])